// 1

// Какие циклы есть в javaScript?

// for, while, do while



// 2 Создайте объект Student, добавьте ему поля на

// усмотрение удалите одно любое поле и сделайте объект неизменяемым.

// Student = {
//     name: "Beknur",
//     surname: "Moldokeev",
//     age: 25,

// }
// delete Student.age
// Object.freeze(Student)
// console.log(Student);




// 3

// Что такое Хоистинг и как его избежать при создании переменной

    // Хойстинг это когда переменная с обьявленного места переходит в начало в самый вверх кода, избежать такого можно не используя var




// 4

// В чем различие между slice, substr, substring и зачем они нужны


// slice() извлекает части строки и возвращает извлеченные части в новой строке. substr() извлекает части строки, начиная с символа в указанной позиции, и возвращает указанное количество символов. substring() извлекает части строки и возвращает извлеченные части в новой строке.




// 5

// Как мы можем получить reference error

    // console.log(arr);
 // при попытке обратиться к необьявленной переменной



// 6

// В чем разница между методом и функцией приведите примеры


// метод позволяет работать только один раз а функция долговечна и к ней можно обращаться в любой части кода 




// 7

// return внутри функций зачем он  нужен? Что вернет функция если нет return

// без ретурна функция при попытке к ней обратиться вернет undefined любая функция должна что то возвращать поэтому нужен ретурн 